tutorials/reactingFoam/counterFlowFlame2D_GRI/Allrun
rm -rf 0.*
rm -rf processor*
rm -rf log*
rm -rf constant/polyMesh
blockMesh > log.blockMesh
decomposePar > log.decompose
N_PROCS=$(find processor* -maxdepth 0 -type d | wc -l)
mpirun -np $N_PROCS reactingFoam -parallel




